
## Plan Result (terraform/env)

[CI link](https://github.com/team-all-in/all-in/actions/runs/10869883705)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_apprunner_service.all_in_api_slack
  * aws_iam_policy.slack_access
  * aws_iam_role_policy_attachment.slack_access


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_apprunner_service.all_in_api_slack will be created
  + resource "aws_apprunner_service" "all_in_api_slack" {
      + arn                            = (known after apply)
      + auto_scaling_configuration_arn = (known after apply)
      + id                             = (known after apply)
      + service_id                     = (known after apply)
      + service_name                   = "all_in"
      + service_url                    = (known after apply)
      + status                         = (known after apply)
      + tags                           = {
          + "Name" = "slack-all-in-apprunner-service"
        }
      + tags_all                       = {
          + "Name" = "slack-all-in-apprunner-service"
        }

      + instance_configuration {
          + cpu               = "0.5 vCPU"
          + instance_role_arn = "arn:aws:iam::451153100141:role/slack-app_runner_ssm_role"
          + memory            = "1 GB"
        }

      + source_configuration {
          + auto_deployments_enabled = true

          + authentication_configuration {
              + access_role_arn = "arn:aws:iam::451153100141:role/slack-apprunner_access_role"
            }

          + image_repository {
              + image_identifier      = "451153100141.dkr.ecr.ap-northeast-1.amazonaws.com/all_in_api_slack:latest"
              + image_repository_type = "ECR"

              + image_configuration {
                  + port                          = "8000"
                  + runtime_environment_secrets   = {
                      + "IV"                  = "arn:aws:ssm:ap-northeast-1:451153100141:parameter/all-in-iv"
                      + "KEY"                 = "arn:aws:ssm:ap-northeast-1:451153100141:parameter/all-in-key"
                      + "OPENAI_API_KEY"      = "arn:aws:ssm:ap-northeast-1:451153100141:parameter/openai_api_key"
                      + "SLACK_APP_TOKEN"     = "arn:aws:ssm:ap-northeast-1:451153100141:parameter/slack_app_token"
                      + "SLACK_BOT_TOKEN"     = "arn:aws:ssm:ap-northeast-1:451153100141:parameter/slack_bot_token"
                      + "SLACK_REFRESH_TOKEN" = "arn:aws:ssm:ap-northeast-1:451153100141:parameter/slack_refresh_token"
                    }
                  + runtime_environment_variables = {
                      + "SUPABASE_ANON_KEY" = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6ImNhamptc29wanp2ZXlwbXljd3FlIiwicm9sZSI6ImFub24iLCJpYXQiOjE3MjYyNDY5ODgsImV4cCI6MjA0MTgyMjk4OH0.JrXfH8vNCla4BzoWVbV6IUPOyrg5PoN239qslbb567Q"
                      + "SUPABASE_URL"      = "https://cajjmsopjzveypmycwqe.supabase.co"
                    }
                }
            }
        }
    }

  # aws_iam_policy.slack_access will be created
  + resource "aws_iam_policy" "slack_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "apprunner-access-ecr"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeImages",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ap-northeast-1:451153100141:repository/all_in_api_slack"
                      + Sid      = "ReadPrivateEcr"
                    },
                  + {
                      + Action   = [
                          + "ssm:DescribeParameters",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeImages",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AuthPrivateEcr"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role_policy_attachment.slack_access will be created
  + resource "aws_iam_role_policy_attachment" "slack_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "slack-apprunner_access_role"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":110,"Program":"tfcmt","SHA1":"9c4105f877b5a4fff58d78023d65029bc9661869","Target":"terraform/env","Vars":{},"WorkflowName":"pull_request_target"} -->